Revit 2027 API
Hardwood.HardwoodColor Property
 The property labeled "Image" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string HardwoodColor { get; }
Public Shared ReadOnly Property HardwoodColor As String
	Get
public:
static property String^ HardwoodColor {
	String^ get ();
}
static member HardwoodColor : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
See Also
Reference
Hardwood Class
Autodesk.Revit.DB.Visual Namespace